/*
 Navicat Premium Data Transfer

 Source Server         : localhost
 Source Server Type    : MySQL
 Source Server Version : 50635
 Source Host           : localhost
 Source Database       : alipay_class

 Target Server Type    : MySQL
 Target Server Version : 50635
 File Encoding         : utf-8

 Date: 09/14/2017 00:20:33 AM
*/

SET NAMES utf8;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
--  Table structure for `pay_config`
-- ----------------------------
DROP TABLE IF EXISTS `pay_config`;
CREATE TABLE `pay_config` (
  `id` int(30) NOT NULL AUTO_INCREMENT,
  `app_id` varchar(30) DEFAULT '' COMMENT 'app_id',
  `merchant_private_key` text COMMENT '私钥',
  `alipay_public_key` text COMMENT '公钥',
  `notify_url` varchar(255) DEFAULT '' COMMENT '异步通知地址',
  `return_url` varchar(255) DEFAULT '' COMMENT '跳转地址',
  `charset` varchar(30) DEFAULT '' COMMENT '编码',
  `sign_type` varchar(30) DEFAULT '' COMMENT '签名方式',
  `gatewayUrl` varchar(255) DEFAULT '' COMMENT '支付宝网关',
  `update_time` int(30) DEFAULT '0' COMMENT '更新时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='支付宝配置表';

-- ----------------------------
--  Records of `pay_config`
-- ----------------------------
BEGIN;
INSERT INTO `pay_config` VALUES ('1', '', '', '', '', '', 'UTF-8', '', 'https://openapi.alipay.com/gateway.do', '0');
COMMIT;

-- ----------------------------
--  Table structure for `pay_record`
-- ----------------------------
DROP TABLE IF EXISTS `pay_record`;
CREATE TABLE `pay_record` (
  `id` int(30) NOT NULL AUTO_INCREMENT,
  `order_no` varchar(100) DEFAULT '' COMMENT '订单编号',
  `user_id` int(30) DEFAULT '0' COMMENT '账户id',
  `type` varchar(50) DEFAULT '' COMMENT '充值类型',
  `money` float(10,2) DEFAULT '0.00' COMMENT '充值金额',
  `status` int(1) DEFAULT '0' COMMENT '是否回调成功（0：初始值 1：成功）',
  `create_time` int(30) DEFAULT '0' COMMENT '时间',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=98 DEFAULT CHARSET=utf8 COMMENT='充值记录表';

-- ----------------------------
--  Records of `pay_record`
-- ----------------------------
BEGIN;
INSERT INTO `pay_record` VALUES ('1', '59560374697af', '1', '支付宝充值', '1000.00', '0', '1500113202'), ('22', '596a1966c2cf3', '1', '支付宝支付', '0.01', '0', '1500125542'), ('23', '596a19ef16771', '1', '支付宝支付', '0.01', '0', '1500125679'), ('24', '596a1a041766a', '1', '支付宝支付', '0.01', '0', '1500125700'), ('25', '596a1a0785c8d', '1', '支付宝支付', '0.01', '0', '1500125703'), ('26', '596a1a20a28b8', '1', '支付宝支付', '0.01', '0', '1500125728'), ('27', '596a1a260a847', '1', '支付宝支付', '0.01', '0', '1500125734'), ('28', '596a1a4eb838b', '1', '支付宝支付', '0.01', '0', '1500125774'), ('29', '596a1a53c2ead', '1', '支付宝支付', '0.01', '0', '1500125779'), ('30', '596a1a6fc015c', '1', '支付宝支付', '0.01', '0', '1500125807'), ('31', '596a1aa712725', '1', '支付宝支付', '0.01', '0', '1500125863'), ('32', '596a1aafd470a', '1', '支付宝支付', '0.01', '0', '1500125871'), ('33', '596a1b2600d5d', '1', '支付宝支付', '0.01', '0', '1500125990'), ('34', '596a1b2954162', '1', '支付宝支付', '0.01', '0', '1500125993'), ('35', '596a1b34b6e34', '1', '支付宝支付', '0.01', '0', '1500126004'), ('36', '596a1b6681426', '1', '支付宝支付', '0.01', '0', '1500126054'), ('37', '596a1b7423f40', '1', '支付宝支付', '0.01', '0', '1500126068'), ('38', '596a1ba2a6106', '1', '支付宝支付', '0.01', '0', '1500126114'), ('39', '596a1ba7975ed', '1', '支付宝支付', '0.01', '0', '1500126119'), ('40', '596a1bb1a90ca', '1', '支付宝支付', '0.01', '0', '1500126129'), ('41', '596a1bff54b9a', '1', '支付宝支付', '0.01', '0', '1500126207'), ('42', '596a1c5d27543', '1', '支付宝支付', '0.01', '0', '1500126301'), ('43', '596a1c8dbda93', '1', '支付宝支付', '0.01', '0', '1500126349'), ('44', '596a1c9a9cc1c', '1', '支付宝支付', '0.01', '0', '1500126362'), ('45', '596a20103c544', '1', '支付宝支付', '0.01', '0', '1500127248'), ('46', '596a203d4925b', '1', '支付宝支付', '0.01', '0', '1500127293'), ('47', '596a204236c82', '1', '支付宝支付', '0.10', '0', '1500127298'), ('48', '596a204811743', '1', '支付宝支付', '1.00', '0', '1500127304'), ('49', '596a206636131', '1', '支付宝支付', '0.01', '0', '1500127334'), ('50', '596a20a0bd9bf', '1', '支付宝支付', '0.01', '0', '1500127392'), ('51', '596a22fa07d98', '1', '支付宝支付', '0.01', '0', '1500127994'), ('52', '5995909f03d3d', '1', '支付宝支付', '0.01', '0', '1502974111'), ('53', '599913de7e546', '1', '支付宝支付', '0.01', '0', '1503204318'), ('54', '59991a09244b1', '1', '支付宝支付', '0.01', '0', '1503205897'), ('55', '59b915775de6c', '1', '支付宝支付', '0.01', '0', '1505301879'), ('56', '59b916370013d', '1', '支付宝支付', '0.01', '0', '1505302071'), ('57', '59b91643df138', '1', '支付宝支付', '0.01', '0', '1505302083'), ('58', '59b91662ec18f', '1', '支付宝支付', '0.01', '0', '1505302114'), ('59', '59b91852673f3', '1', '支付宝支付', '0.01', '0', '1505302610'), ('60', '59b9196a9e2d8', '1', '支付宝支付', '0.01', '0', '1505302890'), ('61', '59b91a0850207', '1', '支付宝支付', '0.01', '0', '1505303048'), ('62', '59b91a326c657', '1', '支付宝支付', '0.01', '0', '1505303090'), ('63', '59b91a854442f', '1', '支付宝支付', '0.01', '0', '1505303173'), ('64', '59b91aa804633', '1', '支付宝支付', '0.01', '0', '1505303208'), ('65', '59b91acf81edd', '1', '支付宝支付', '0.01', '0', '1505303247'), ('66', '59b91ae352005', '1', '支付宝支付', '0.01', '0', '1505303267'), ('67', '59b91af2140c9', '1', '支付宝支付', '0.01', '0', '1505303282'), ('68', '59b91b0d3ee93', '1', '支付宝支付', '0.01', '0', '1505303309'), ('69', '59b91b8042ed7', '1', '支付宝支付', '0.01', '0', '1505303424'), ('70', '59b91b9221b2a', '1', '支付宝支付', '0.01', '0', '1505303442'), ('71', '59b91bada7340', '1', '支付宝支付', '0.01', '0', '1505303469'), ('72', '59b91bb9caf5b', '1', '支付宝支付', '0.01', '0', '1505303481'), ('73', '59b91be46cc16', '1', '支付宝支付', '0.01', '0', '1505303524'), ('74', '59b91bea90cfe', '1', '支付宝支付', '0.01', '0', '1505303530'), ('75', '59b91c2e11624', '1', '支付宝支付', '0.01', '0', '1505303598'), ('76', '59b91ca199d3a', '1', '支付宝支付', '0.01', '0', '1505303713'), ('77', '59b91cac7be28', '1', '支付宝支付', '0.01', '0', '1505303724'), ('78', '59b91cdf2d7e1', '1', '支付宝支付', '0.01', '0', '1505303775'), ('79', '59b93362a53ae', '1', '支付宝支付', '0.01', '0', '1505309538'), ('80', '59b933db8e583', '1', '支付宝支付', '0.01', '0', '1505309659'), ('81', '59b934c714bcc', '1', '支付宝支付', '0.01', '0', '1505309895'), ('82', '59b934debb515', '1', '支付宝支付', '0.01', '0', '1505309918'), ('83', '59b9356f08252', '1', '支付宝支付', '0.01', '0', '1505310063'), ('84', '59b9358e3e68c', '1', '支付宝支付', '0.01', '0', '1505310094'), ('85', '59b9359bf1bfe', '1', '支付宝支付', '0.01', '0', '1505310107'), ('86', '59b935a5a3993', '1', '支付宝支付', '0.01', '0', '1505310117'), ('87', '59b935b668203', '1', '支付宝支付', '0.01', '0', '1505310134'), ('88', '59b935bdad706', '1', '支付宝支付', '0.01', '0', '1505310141'), ('89', '59b936c44b34f', '1', '支付宝支付', '0.01', '0', '1505310404'), ('90', '59b93705c655c', '1', '支付宝支付', '0.01', '0', '1505310469'), ('91', '59b93733d67b8', '1', '支付宝支付', '0.01', '0', '1505310515'), ('92', '59b9373af17ee', '1', '支付宝支付', '0.01', '0', '1505310522'), ('93', '59b93772bc19c', '1', '支付宝支付', '0.01', '0', '1505310578'), ('94', '59b9377ac5ae8', '1', '支付宝支付', '0.01', '0', '1505310586'), ('95', '59b9392c9fe6f', '1', '支付宝支付', '0.01', '0', '1505311020'), ('96', '59b956832f8cb', '1', '支付宝支付', '0.01', '0', '1505318531'), ('97', '59b956948c9d8', '1', '支付宝支付', '0.01', '0', '1505318548');
COMMIT;

-- ----------------------------
--  Table structure for `pay_users`
-- ----------------------------
DROP TABLE IF EXISTS `pay_users`;
CREATE TABLE `pay_users` (
  `id` int(30) NOT NULL AUTO_INCREMENT,
  `username` varchar(100) DEFAULT '' COMMENT '账户名称',
  `money` float(10,2) DEFAULT '0.00' COMMENT '账户余额',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8 COMMENT='账户表';

-- ----------------------------
--  Records of `pay_users`
-- ----------------------------
BEGIN;
INSERT INTO `pay_users` VALUES ('1', '188888888888', '100000.00');
COMMIT;

SET FOREIGN_KEY_CHECKS = 1;
